/*!
 * @file       PID.c
 * @brief      PID调节函数
 * @author     
 * @version    v1.0
 * @date       2020-3-5
 */

#include "headfile.h"
#include "smartcar.h"

//------------------------------------------------------------------------------------------------------------------------------------
//电机Motor_P，Motor_I，Motor_D需要调节
//舵机范围需要调节
//模糊规则表需要调节
//------------------------------------------------------------------------------------------------------------------------------------
uint16 Kp1 = 85, Kp2 = 135;   //大P值，小P值
uint16 e1 =10, e2 =30;   //大误差，小误差
//电感模糊控制参数
//——————————————————————————————————————————————————————————————————
//e 和 ec确定方式：将e  和 ec显示OLED上，将最大值代入到范围的最大值位置上
//P和D调试方法：用之前用于估计的PD值
//——————————————————————————————————————————————————————————————————
float e_Rule_diangan[5] = {0,0,0,0,0};  //输入误差（e）的范围，由负到正 
float ec_Rule_diangan[5] = {0,0,0,0,0};   //输入误差变化率（ec）的范围，由负到正
float kp_Rule_diangan[5] = {-105,-85,0,85,105};   //输出的P值的范围
float kd_Rule_diangan[5] = {0,0,0,0,0};   //输出的D值的范围
//模糊控制隶属度计算
//——————————————————————————————————————————————————————————————————
//不需调试
//——————————————————————————————————————————————————————————————————
float eFuzzy[2] = {0,0};   //误差e属于前后两个模糊集的隶属度
float ecFuzzy[2] = {0,0};   //误差ec属于前后两个模糊集的隶属度
//查询模糊规则表时记录隶属度的位置
//——————————————————————————————————————————————————————————————————
//不需调试
//——————————————————————————————————————————————————————————————————
uint8 pe = 0;   //误差e的隶属度的位置
uint8 pec = 0;   //误差ec的隶属度的位置
//查询模糊规则表后每个模糊子集的隶属度还原
//——————————————————————————————————————————————————————————————————
//不需调试
//——————————————————————————————————————————————————————————————————
float Fuzzy_kp[6] = {0};   //P值模糊规则表的隶属度还原
float Fuzzy_kd[6] = {0};   //D值模糊规则表的隶属度还原
//电感模糊控制结果
//——————————————————————————————————————————————————————————————————
//输出结果
//所以不需调试
//——————————————————————————————————————————————————————————————————
float Steer_P_diangan = 5;   //电感结果的舵机的输出值
float Steer_D_diangan = 200;

//控制规则表
//——————————————————————————————————————————————————————————————————
//部分参数需要调
//——————————————————————————————————————————————————————————————————
int kp_Rule_table[6][6]=//p值规则表
{
  //ec 0 1 2 3 4   // e
      {4,4,4,3,2,5},//0          
      {4,3,3,2,1,5},//1       
      {4,3,2,1,0,5},//2     
      {3,2,1,1,0,5},//3         
      {2,1,0,0,0,5},//4           
      {5,5,5,5,5,5} //
};

int kd_Rule_table[6][6]=  //d值规则表
{
  //ec 0 1 2 3 4  //e
      {3,1,4,0,3,5},//0    
      {2,1,3,1,2,5},//1   
      {2,1,2,1,2,5},//2    
      {3,2,1,2,3,5},//3         
      {4,3,0,3,4,5},//4
      {5,5,5,5,5,5} //
};
//电机PID值
//——————————————————————————————————————————————————————————————————
//参数需要像调参时候的调试
//——————————————————————————————————————————————————————————————————

float Motor_P = 0.0;
float Motor_I = 0.0;
float Motor_D = 0.0;

 /*******************************************************************************
 *  @brief      fuzzy_canshu_init函数
 *  @note       模糊参数初始化函数
 *  @data       2020-7-19 代码参考师兄建议
 ******************************************************************************/
 void fuzzy_canshu_init()
 {
     kp_Rule_diangan[0] = -Kp2;
     kp_Rule_diangan[1] = -Kp1;
     kp_Rule_diangan[3] = Kp1;
     kp_Rule_diangan[4] = Kp2;
     e_Rule_diangan[0] = -e2;
     e_Rule_diangan[1] = -e1;
     e_Rule_diangan[3] = e1;
     e_Rule_diangan[4] = e2;
 }

/*******************************************************************************
 *  @brief      fuzzy_mem_cal_diangan函数
 *  @note       隶属度计算函数，三角形隶属函数
 *  @data       2020-3-6 代码参考去年B车 
 ******************************************************************************/
void fuzzy_mem_cal_diangan()  
{
    fuzzy_canshu_init();                
/*****************误差*****************/
    if(diangan_e < e_Rule_diangan[0])
    {
        eFuzzy[0] = 1.0;
        pe = 0;
    }
    else if(diangan_e < e_Rule_diangan[1])   //若误差e位于区间[x，y]，则误差e属于x的隶属度为（y-e）/（y-x）
    {
        eFuzzy[0] = (e_Rule_diangan[1] - diangan_e)/(e_Rule_diangan[1] - e_Rule_diangan[0]);
        pe = 0;
    }
    else if(diangan_e < e_Rule_diangan[2])
    {
        eFuzzy[0] = (e_Rule_diangan[2] - diangan_e)/(e_Rule_diangan[2] - e_Rule_diangan[1]);
        pe = 1;
    }
    else if(diangan_e < e_Rule_diangan[3])
    {
        eFuzzy[0] = (e_Rule_diangan[3] - diangan_e)/(e_Rule_diangan[3] - e_Rule_diangan[2]);
        pe = 2;
    }
    else if(diangan_e < e_Rule_diangan[4])
    {
        eFuzzy[0] = (e_Rule_diangan[4] - diangan_e)/(e_Rule_diangan[4] - e_Rule_diangan[3]);
        pe = 3;
    }
    else
    {
        eFuzzy[0] = 1.0;
        pe = 4;
    }
    eFuzzy[1] = 1.0-eFuzzy[0];   //根据三角形隶属函数，属于前后两个模糊子集的隶属度之和为1
/*****************误差变化率*****************/
    pec = 2;
    ecFuzzy[0] = 1.0;
    ecFuzzy[1] = 0;
}

/*******************************************************************************
 *  @brief      fuzzy_query_diangan函数
 *  @note       查询模糊规则表，算出输出各模糊子集的占比
 *  @data       2020-3-6  代码参考去年B车 
 ******************************************************************************/
void fuzzy_query_diangan()
{
    uint8 i,num = 0;
    for(i=0;i<5;i++)   //清空数组以便累加
    {
        Fuzzy_kp[i] = 0;
    }
    /*查询Kp模糊规则表*/
    num = kp_Rule_table[pe][pec];
    Fuzzy_kp[num] += eFuzzy[0] * ecFuzzy[0];	
    
    num = kp_Rule_table[pe+1][pec];
    Fuzzy_kp[num] += eFuzzy[1] * ecFuzzy[0];
}

/*******************************************************************************
 *  @brief      fuzzy_solve_diangan函数
 *  @note       重心法解模糊，得到调节的Kp、Kd值
 *  @data       2020-3-6  代码参考去年B车 
 ******************************************************************************/
void fuzzy_solve_diangan()
{
    uint8 i;
    Steer_P_diangan = 0;   //清空P值以便累加
    /*面积中心法解模糊*/
    for(i=0;i<5;i++)   //重心法解模糊得到得到pd值
    {
        Steer_P_diangan += Fuzzy_kp[i] * kp_Rule_diangan[i];
    }
}
